Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/national_elections/by_elections_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: If a TD (member of Parliament) dies or resigns, his or her seat in Parliament will be filled by a bye-election unless it is only a short time until the next general election
ga: Má fhaigheann TD bás nó má éiríonn sé/sí as, líontar a s(h)uíochán trí fothoghchán a reachtáil mura mbeidh olltoghchán le bheith ann go luath

source: When a TD dies or resigns, the Dáil (one of the houses of Parliament in Ireland) passes a resolution directing that a writ be issued to the returning officer of the TD's constituency to hold an election to fill the vacancy
ga: Nuair a fhaigheann TD bás, nó nuair a éiríonn sé/sí as, ritheann an Dáil rún ag tabhairt ordaithe do cheann comhairimh dháilcheantar an Teachta Dála toghchán a reachtáil chun an folúntas a líonadh

source: Until 2011 there was no time limit for the passing of the resolution by the Dáil
ga: Go dtí 2011 ní raibh aon teorainn ama ar an Dáil chun an rún a rith

source: The Electoral (Amendment) Act 2011 provides that if the Dáil does not move to have the writ issued within 6 months the Ceann Comhairle must direct the Clerk of the Dáil to issue the writ
ga: Soláthraíonn an tAcht Toghcháin (Leasú) 2011, mura dtairgeann an Dáil an t-eascaire a eisiúint laistigh 6 mhí go gcaithfidh an Ceann Comhairle an Cléireach Dála a ordú chun an t-eascaire a eisiúint

source: Tradition dictates that when a TD dies, the former member's own party will move the writ but not until at least a month has passed
ga: Nuair a fhaigheann TD bás, tá an nós ann go molann páirtí an iartheachta an tairiscint ach ní dhéantar é go dtí go bhfuil mí ar a laghad thart

source: The procedure for the nomination of candidates, voting and the conduct of the count in Dáil bye-elections is the same as for a general election
ga: Tá an modh céanna i bhfeidhm chun iarrthóirí a ainmniú, vótáil agus don chomhaireamh i bhfothoghcháin Dála agus atá don olltoghchán

source: The difference is that only one seat is being filled in a bye-election
ga: Níl de dhifríocht ann ach nach bhfuil ach suíochán amháin le líonadh i bhfothoghchán

source: A person who is currently a member of Dáil Eireann cannot be a candidate in a Dáil bye-election
ga: Ní féidir le duine atá ina t(h)eachta i nDáil Éireann cheana féin a bheith ina (h)iarrthóir i bhfothoghchán Dála

source: Bye-election posters and signs
ga: Póstaeir agus comharthaí a bhaineann le fothoghcháin

source: The law forbids the erection of posters and signs on poles or other structures in public places unless you have the written permission of the owner of the pole or other structure in advance of putting up the posters and signs
ga: Cuireann dlí cosc ar phóstaeir/comharthaí a chrochadh ar phollaí nó ar struchtúir eile in áiteanna poiblí, mura bhfuil cead scríofa úinéara an pholla nó struchtúir eile faighte agat sula gcuireann tú an póstaer/comhartha in airde

source: Under the Litter Pollution Act 1997, as amended by Section 9 of the Electoral (Amendment) (No. 2) Act 2009, election posters and signs cannot be erected until an order has been made appointing the polling date for the bye-election or for 30 days prior to the date of the poll (whichever is the shorter period)
ga: De réir an Achta um Thruailliú ó Bhruscar 1997, arna leasú ag Alt 9 den Toghcháin (Leasú) (Uimh 2) 2009, ní féidir leat a thógáil póstaeir toghcháin agus comharthaí go dtí go mbeidh ordú déanta ag ceapadh dáta vótála don chorrthoghchán nó ar feadh 30 lá roimh dháta na vótaíochta (cibé acu is tréimhse níos giorra)

source: Local authorities have the power to remove these items should they disintegrate or cause a litter nuisance
ga: Tá cumhacht ag údaráis áitiúla na míreanna sin a bhaint anuas má dhíscaoileann siad nó má chruthaítear núis bhruscair

source: Following a bye-election, a party or candidate must remove posters within a 7-day period
ga: Tar éis fothoghcháin, caithfidh páirtí/iarrthóir na póstaeir a bhaint anuas laistigh de thréimhse seacht lá

source: After that date, an on-the-spot fine of €150 is issued by your local authority in respect of each remaining poster
ga: Tar éis an dáta sin, eisíonn d’údarás áitiúil fíneáil ar an láthair €150 i ndáil le gach póstaer ar leith atá fágtha thuas

source: Your local authority will remove the poster as the fine is issued
ga: Bainfidh d’údarás áitiúil an póstaer anuas de mar a eisítear fíneáil

source: If a party or candidate has been issued with a fine and refuses to pay, they can be prosecuted in the District Court by your local authority to enforce payment
ga: Má eisítear fíneáil ar pháirtí/iarrthóir agus go ndiúltaítear íocaíocht a dhéanamh, féadfaidh d’údarás áitiúil iad a ionchúiseamh sa Chúirt Dúiche chun an íocaíocht fhorfheidhmiú

source: The maximum penalty in the District Court following conviction for non-payment of the fine is €3,000
ga: An t-uasphionós sa Chúirt Dúiche tar éis an chiontaithe ar neamhíoc na fíneála ná €3,000
